<template>
  <v-dialog max-width="380" persistent scrollable :value="dialog">
    <v-card>
      <v-card-title>プライバシーポリシー</v-card-title>
      <v-card-text>
        本ウェブサイトの管理者（以下、「管理者」といいます。）は、本ウェブサイト上で提供するサービス（以下,「本サービス」といいます。）における、ユーザーの個人情報の取扱いについて、以下のとおりプライバシーポリシー（以下、「本ポリシー」といいます。）を定めます。
        <br /><br />
        第1条（個人情報）<br />
        「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報及び容貌、指紋、声紋にかかるデータ、及び健康保険証の保険者番号などの当該情報単体から特定の個人を識別できる情報（個人識別情報）を指します。
        <br /><br />
        第2条（個人情報の収集方法）<br />
        管理者は、ユーザーが利用登録をする際に氏名、生年月日、住所、電話番号、メールアドレス、銀行口座番号、クレジットカード番号、運転免許証番号などの個人情報をお尋ねすることがあります。また、ユーザーと提携先などとの間でなされたユーザーの個人情報を含む取引記録や決済に関する情報を,管理者の提携先（情報提供元、広告主、広告配信先などを含みます。以下、｢提携先｣といいます。）などから収集することがあります。
        <br /><br />
        第3条（個人情報を収集・利用する目的）<br />
        管理者が個人情報を収集・利用する目的は、以下のとおりです。
        <p>・管理者サービスの提供・運営の為</p>
        <p>・ユーザーからのお問い合わせに回答する為（本人確認を行うことを含む）</p>
        <p>・メンテナンス、重要なお知らせなど必要に応じたご連絡の為</p>
        <p>
          ・利用規約に違反したユーザーや、不正・不当な目的でサービスを利用しようとするユーザーの特定をし、ご利用をお断りする為
        </p>
        <p>・ユーザーにご自身の登録情報の閲覧や変更、削除、ご利用状況の閲覧を行っていただく為</p>
        <p>・有料サービスにおいて、ユーザーに利用料金を請求する為</p>
        <p>・その他、上記の利用目的に付随する目的の為</p>
        <br />
        第4条（利用目的の変更）<br />
        管理者は、利用目的が変更前と関連性を有すると合理的に認められる場合に限り、個人情報の利用目的を変更するものとします。
        利用目的の変更を行った場合には、変更後の目的について、管理者所定の方法により、ユーザーに通知し、または本サービス上に公表するものとします。
        <br /><br />
        第5条（個人情報の訂正および削除）<br />
        ユーザーは、管理者の保有する自己の個人情報が誤った情報である場合には、管理者が定める手続きにより、管理者に対して個人情報の訂正、追加または削除（以下、「訂正等」といいます。）を請求することができます。
        管理者は、ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の訂正等を行うものとします。
        管理者は、前項の規定に基づき訂正等を行った場合、または訂正等を行わない旨の決定をしたときは遅滞なく、これをユーザーに通知します。
        <br /><br />
        第6条（個人情報の利用停止等）<br />
        管理者は、本人から、個人情報が、利用目的の範囲を超えて取り扱われているという理由、または不正の手段により取得されたものであるという理由により、その利用の停止または消去（以下、「利用停止等」といいます。）を求められた場合には、遅滞なく必要な調査を行います。
        前項の調査結果に基づき、その請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の利用停止等を行います。
        管理者は、前項の規定に基づき利用停止等を行った場合、または利用停止等を行わない旨の決定をしたときは、遅滞なく、これをユーザーに通知します。
        前2項にかかわらず、利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって、ユーザーの権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じるものとします。
        <br /><br />
        第7条（プライバシーポリシーの変更）<br />
        本ポリシーの内容は、法令その他本ポリシーに別段の定めのある事項を除いて、ユーザーに通知することなく、変更することができるものとします。
        管理者が別途定める場合を除いて、変更後のプライバシーポリシーは、本ウェブサイトに掲載したときから効力を生じるものとします。
        <br /><br />
        第8条（アクセス解析ツールについて）<br />
        本ウェブサイトでは、Googleによるアクセス解析ツール「Googleアナリティクス」を利用しています。
        このGoogleアナリティクスはトラフィックデータの収集のためにCookieを使用しています。
        このトラフィックデータは匿名で収集されており、個人を特定するものではありません。
        この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認下さい。
        <br /><br />
        第9条（広告の配信について）<br />
        本ウェブサイトでは、第三者配信の広告サービス（Googleアドセンス、A8.net）を利用しており、ユーザーの興味に応じた商品やサービスの広告を表示するため、Cookieを使用しております。
        Cookieを使用することで本ウェブサイトはお客様のコンピュータを識別できるようになりますが、お客様個人を特定できるものではありません。
        この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認下さい。
        <br /><br />
        第10条（免責事項）<br />
        本ウェブサイトに掲載されている情報の正確性には万全を期していますが、利用者が本ウェブサイトの情報を用いて行う一切の行為に関して、一切の責任を負わないものとします。
        当社は、利用者が本ウェブサイトを利用したことにより生じた利用者の損害及び利用者が第三者に与えた損害に関して、一切の責任を負わないものとします。
        <br /><br />
        第11条（著作権）<br />
        当ウェブサイト内のコンテンツ（文章・写真・イラスト・動画・音声等）の著作権ならびに､商品名､サービス名等の商標は､本サービスまたは本サービスに許諾を与えた提携先が権利を保有しています。許可なく複製､転用､販売等の二次利用を行なうことを禁じます。また､コンテンツの内容を変形・変更・加筆修正することは一切認めておりません。
      </v-card-text>
      <v-divider />
      <v-card-actions>
        <v-spacer />
        <v-btn color="#1a237e" text @click="handleHide">閉じる</v-btn>
      </v-card-actions>
    </v-card>
  </v-dialog>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'

export default defineComponent({
  name: 'DialogPrivacyPolicy',

  props: {
    dialog: { type: Boolean, default: false }
  },

  setup(_, ctx) {
    const handleHide = (): void => ctx.emit('hide')

    return { handleHide }
  }
})
</script>
